In [2]:
import pandas
import glob

In [3]:
# Initialize file names
DATA_FILE_HOME="../data/"
SURVEY_VISITED=DATA_FILE_HOME + "survey_visited.csv"
SURVEY_SITE = DATA_FILE_HOME + "survey_site_added_sites.csv"

In [4]:
# Initialize dataframe
df_visited = pandas.read_csv(SURVEY_VISITED)
df_site = pandas.read_csv(SURVEY_SITE)

In [5]:
# Visited data frame
df_visited.head()

   ident  site       dated
0    619  DR-1  1927-02-08
1    622  DR-1  1927-02-10
2    734  DR-3  1939-01-07
3    735  DR-3  1930-01-12
4    751  DR-3  1930-02-26

In [6]:
# Site data frame
df_site.head()

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
3   HERN -50.00  -50.00

In [7]:
# How many times each site was visited. 
df_visit_count = df_visited[['site','dated']]
df_visit_count_grouped = df_visit_count.groupby('site').agg(['count'])
df_visit_count_grouped.head()

      dated
      count
site
DR-1      3
DR-3      3
MSK-4     1

In [13]:
# Sites that were visited
unique_visited_sites = df_visited['site']
unique_visited_sites.unique()

# Site that was never visited by performing a Set minus operation
site_names = df_site['name']

# Sites that were never visited
sites_never_visited = site_names[~ site_names.isin(unique_visited_sites) ]
sites_never_visited.rename("sites not visited")
print( sites_never_visited  )

3    HERN
Name: name, dtype: object

In [14]:
# Min and Max visited dates
df_visited['dated'].agg(['min','max'])

min           inf
max    1939-01-07
Name: dated, dtype: object

In [16]:
# Look at the sites that have been visited and then identify the dates.
# Step 1. Extract the rows in which 'dated' column is not null. 
# Step 2. Aggregate min and max functions using that resultset. 
old_new_visited = df_visited.loc[  pandas.isnull(df_visited['dated']) == False ] ['dated'] .agg(['min','max'])

In [20]:
# Earliest visited sites
df_visited.loc[ df_visited['dated'] == old_new_visited['min'] ]  [['site', 'dated']]

   site       dated
0  DR-1  1927-02-08

In [21]:
# Newest visited sites
df_visited.loc [ df_visited['dated'] == old_new_visited['max'] ] [['site', 'dated']]

   site       dated
2  DR-3  1939-01-07